{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "97d0bd1b",
   "metadata": {},
   "source": [
    "# Проведите дисперсионный анализ сегментации клиентов\n",
    "## Условие задачи\n",
    "\n",
    "Вы работаете в онлайн-школе аналитиком. Вы знаете, что все клиенты школы были разделены на сегменты A/B/C/D на основе экспертной оценки. Это сделано, чтобы обеспечить высокий уровень клиентского сервиса.\n",
    "\n",
    "Сейчас вы хотите оказывать клиентскую поддержку различным группам пользователей в зависимости от их возраста и наличия высшего образования. Ваша задача оценить, подходит ли текущая сегментация пользователей для новых задач или ее необходимо переделать.\n",
    "\n",
    "**Формальное описание задачи:**\n",
    "\n",
    "Оценить, влияет ли возраст и уровень образования на сегмент пользователя.\n",
    "\n",
    "**Алгоритм решения:**\n",
    "\n",
    "1. Загрузите данные из файла формата CSV.\n",
    "2. Проведите предварительный анализ данных: изучите структуру набора данных, определите переменные, которые необходимо будет исследовать. Удалите наблюдения, в которых необходимые переменные пропущены.\n",
    "3. Проведите One-way ANOVA и Two-way ANOVA.\n",
    "4. Проверьте ограничения на применимость методов: нормальность и гомоскедастичность. Независимость наблюдений гарантируется.\n",
    "5. Проведите апостериорный анализ при наличии статистически значимых результатов.\n",
    "6. Сделайте выводы о влиянии уровня образования и возраста на сегмент пользователя.\n",
    "\n",
    "**Входные данные:**\n",
    "\n",
    "[Customer Segmentation.csv](https://github.com/Eduson-DataScience/EDA-Practice/blob/main/Define_data_taxonomy_in_different_variations%20copy%205/Customer%20Segmentation.csv)\n",
    "\n",
    "## Подсказки\n",
    "\n",
    "- Проверьте, что у вас есть файл с данными (Customer Segmentation.csv) и он находится в том же каталоге, что и ваш скрипт.\n",
    "- Используйте метод `ols` из библиотеки statsmodels для проведения дисперсионного анализа.\n",
    "- Для проверки нормальности остатков воспользуйтесь методом построения графика `qqplot` из библиотеки statsmodels, а для проверки гомоскедастичности остатков – `bartlett` из библиотеки scipy.\n",
    "- Не забудьте провести апостериорный анализ для выявления групп, между которыми есть отличия в средних значениях."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6ef37b4a",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import seaborn as sns\n",
    "\n",
    "from scipy import stats\n",
    "\n",
    "# anova model from formula\n",
    "from statsmodels.formula.api import ols\n",
    "# anova table from ols model\n",
    "from statsmodels.stats.anova import anova_lm\n",
    "# for qqplot\n",
    "import statsmodels.api as sm\n",
    "# tukey test\n",
    "from statsmodels.stats.multicomp import pairwise_tukeyhsd\n",
    "\n",
    "# загружаем данные\n",
    "data = pd.read_csv('Customer Segmentation.csv', index_col=0)\n",
    "data.head()\n",
    "\n",
    "data.info()\n",
    "\n",
    "# удаляем наблюдения с пропущенными значениями\n",
    "data = data[data.Graduated.isna() != True]\n",
    "\n",
    "sns.boxplot(data=data, x='Segmentation', y='Age', hue='Graduated');\n",
    "\n",
    "#one-way anova\n",
    "one_way = ols('Age ~ Segmentation', data).fit()\n",
    "anova_lm(one_way)\n",
    "\n",
    "#qq-plot, проверяем нормальность остатков\n",
    "sm.qqplot(one_way.resid, line='s');\n",
    "\n",
    "#разделяем данные по сегментам, чтобы провести тест Левена\n",
    "groups = []\n",
    "for group_id, group in data.groupby(['Segmentation']):\n",
    "    groups.append(group.Age)\n",
    "\n",
    "#тест Левена\n",
    "stats.bartlett(*groups)\n",
    "\n",
    "#апостериорный анализ\n",
    "print(pairwise_tukeyhsd(endog=data.Age, groups=data.Segmentation, alpha=0.05))\n",
    "\n",
    "#two-way anova\n",
    "two_way = ols('Age ~ Segmentation + Graduated + Segmentation:Graduated', data).fit()\n",
    "anova_lm(two_way)\n",
    "\n",
    "#qq-plot, проверяем нормальность остатков\n",
    "sm.qqplot(two_way.resid, line='s');\n",
    "\n",
    "#разделяем данные по сегментам и образованию, чтобы провести тест Левена\n",
    "groups = []\n",
    "for group_id, group in data.groupby(['Segmentation', 'Graduated']):\n",
    "    groups.append(group.Age)\n",
    "\n",
    "#тест Левена\n",
    "stats.bartlett(*groups)\n",
    "\n",
    "#апостериорный анализ\n",
    "data['combination'] = data.Segmentation + '/' + data.Graduated\n",
    "print(pairwise_tukeyhsd(endog=data.Age.astype('float'), groups=data.combination, alpha=0.05))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2e3d0c18",
   "metadata": {},
   "source": [
    "Из проведенного анализа данных можно сделать следующие выводы:\n",
    "\n",
    "1. Возраст пользователя имеет статистическую значимость при разделении на сегменты. Также возраст пользователя имеет статистическую значимость при разделении сегментов на уровни образования в них.\n",
    "2. Для нового типа клиентской поддержки нет необходимости менять текущую сегментацию пользователей, достаточно будет только подразделить уже существующие сегменты по уровню образования."
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
